USE [Store]
SELECT [dbo].[F_AvrageTransferTime] (3)--statusid
 --SELECT * FROM Vw_OrderDeliveryPerformance
 --میانگین زمان تحویل کالا به مشتری با توجه به وضعیت کالا
 --با مشخص کردن وضعیت فرایندی کالا
 ---------------------------------------------
 SELECT * FROM DBO.[F_AvgYearDiscaunt] ('2025-11-01' , '2026-12-09' )--@FromDate DATE, @ToDate DATE
--نمایش میانگین تخفیف های اعمال شده در فاکتور ها به ازای سال
--با مشحص کردن بازه زمانی مربوطه
----------------------------------------------
SELECT * FROM DBO.F_YearSaleRate(2025,2026)--@FromYear CHAR(4),@ToYear CHAR(4)
--میزان فروش و درصد رشد فروش نسبت به سال گذشته 
--با مشخص کردن بازه بین دو سال ورودی
----------------------------------------------
SELECT * FROM DBO.F_MothSaleRate(0,6)--(@Year INT,@Month INT؟؟؟؟؟؟؟؟؟؟؟؟؟؟؟؟با ورود ماه باید نسبت ماه گذشته رو خودش بده
--و ماه های مشترک در سال های متفاوت و تشخیص بده
--میزان فروش و درصد فروش نسبت به ماه گذشته
----------------------------------------------
SELECT * FROM  Fn_TransferControl (0) --(@Year INT)
--نمایش تعداد فاکتورها در زمان ارسال به موقع یا با تاخیر 
--در یک سال مشخص ورودی و یا برای تمام سال ها باورود عدد صفر
----------------------------------------------
SELECT * FROM  Fn_CitySaleRate (2024,2026,0) --(@FromDate CHAR(4),@ToDate CHAR(4),@CountryCode INT)
--نمایش میزان فروش در هر شهر به ازای کد کشور ورودی
--در بین سالهای انتخابی
--نمایش کل کشور ها به ازای ورود عدد صفر
-----------------------------------------------
SELECT * FROM  Fn_SaleRateInYearAndMonth (0,2026)--(@FromYear CHAR(4),@ToYear CHAR(4))
--نمایش میزان فروش ماهانه و سالانه در هر سال
--با ورود دو سال مشخص
-----------------------------------------------
SELECT * FROM  Fn_CheckUpdateProductStock()
--نمایش محصولاتی که مقدار موجودی انها در انبار بعد از فروش به روز نشده است
