EXEC SP_CategorySale '2026-02-01','2026-04-05','0'  --@DATE1 DATE, @DATE2 DATE, @CATEGORY INT	
--مشاهده ی نام و تعداد محصولات در یک دسته مشخص شده
--   با مشخص کردن بازه ی زمانی و دسته ی محصولات
--  جهت مشاهده ی همه ی دسته ها ورود مقدار صفر 
--=============================================

EXEC  SP_CountryTotalSale_Percent '2026-02-01','2026-04-05','101'--@Date1 CHAR(10), @Date2 CHAR(10), @Persent NUMERIC(18,2)
--مشاهده ی کشور های مشتریان و میزان فروش انها
-- با مشخص کردن بازه ی زمانی و میزان درصد فروش 
-- برا مشاهده ی همه مشتریان ورود مقدار 101
--=============================================

EXEC SP_CustomerSpent '100','2020-02-01' ,'2026-06-06'--@top INT,@FromDate DATE ,@ToDate DATE 
--رتبه بندی مشتریان و 
--مشاهده ی اطلاعات مشتریان و میزان و درسد خرید انها
-- با مشخص کردن بازه ی زمانی  
--درصورت عدم ورودی برای تاریخ ها بازه ی یک سال اخیر را در نظر میگیرد
--=============================================

EXEC SP_ProductSale 2026,'' --@Year INT ,@Month INT
--مشاهده ی اطلاعات فروش محصولات 
-- با مشخص کردن سال و ماه مورد نظر
--درصورت وارد نکردن سال و ماه اطلاعات کل ماه ها و سال ها نمایش داده میشود
--=============================================

EXEC SP_Monthlysale '',3  --@Year INT ,@Month INT
--مشاهده ی میزان فروش  
-- با مشخص کردن سال و ماه مورد نظر
--درصورت وارد نکردن سال و ماه اطلاعات کل ماه ها و سال ها نمایش داده میشود
--=============================================

EXEC SP_Yearlysale '' --@YEAR INT 
--مشاهده ی میزان فروش  
-- با مشخص کردن سال مورد نظر
--درصورت وارد نکردن سال اطلاعات تمام سال ها نمایش داده میشود
--=============================================
select * from Personnel
select * from Customer
-----------------------------
EXEC SP_Create_NewOrder 3,2,N'فروش ویژه' --@CustomerCode INT,@UserId INT,@Description NVARCHAR(200)
--برای اینکه کد مشتری و کد پرسنل  به درستی وارد بشه چکار کنیم؟؟؟؟؟؟؟؟؟؟؟؟؟؟؟؟؟؟؟؟؟؟
--ایجاد فاکتور جدید فروش کالا  
-- با مشخص کردن شماره مشتری،شماره پرسنل،توضیحات
--=============================================

SELECT * from FactorHeader
SELECT * from Product
		-------------------------
 EXEC SP_AddItemToOrder 6,2,5,28725.20,0.20,0.09 --@FactorHeaderId INT, @ProductId INT, @Quantity SMALLINT, @UnitPrice DECIMAL(18,2), @DiscountPercent DECIMAL(5,2),  @TaxPercent DECIMAL(5,2)
--شماره فاکتور رو از کجا بیاریم؟ شماره فاکتوری که در پروسیجر قبلی ایجاد شده؟؟؟؟؟؟؟؟؟؟؟؟؟؟؟؟؟؟
--افزودن کالا به فاکتور فروش کالا  
-- با مشخص کردن شماره فاکتور،شماره و تعداد و قیمت محصول و درصد تخفیف و درصد مالیات
--=============================================
 EXEC SP_UpdateProductStock 1,2 --@ProductId INT,@SaleQuantity INT
--بروز رسانی موجودی کالا بعد از افزودن به فاکتور  
-- با مشخص کردن شماره و تعداد محصول
--Fn_CheckUpdateProductStock--دریافت شماره و تعداد محصول از این فانکشن

--=============================================

select StatusId from FactorHeader where Id=6
EXEC SP_ChengeStats 5,5 --@FactorHeaderId INT,@NewStatusId INT--؟؟؟؟؟؟؟وضعیت جدید از کجا بیاریم کاربر که وارد نمیکنه
--بروز رسانی وضعیت فاکتور   
-- با مشخص کردن شماره فاکتور و ای دی وضعیت جدید
--=============================================

